#pragma once
#include <iostream>
using namespace std;

//-------------------------------------------------------------------------------//
//функции для проверки на нечисловой ввод 
void InputInt(int& x);//для int
void InputDouble(double& x);//для double 
//-------------------------------------------------------------------------------//


//-------------------------------------------------------------------------------//
void coutChar(char sym, int num);//функция, которая выводит заданный символ онное количество раз 
int checkNumberAndDiapason(int a, int b, string mass); //Проверяет соответствие передаваемому диапазону и выводит сообщение для кого именно диапозона. 
//-------------------------------------------------------------------------------//


